v2206/solidQuenching2D/constant/solid/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2206                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=64;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/solid/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

3
(
    symmetric
    {
        type            symmetry;
        inGroups        1(symmetry);
        nFaces          50;
        startFace       940;
    }
    emptyPatch
    {
        type            empty;
        inGroups        1(empty);
        nFaces          1000;
        startFace       990;
    }
    solid_to_water
    {
        type            mappedWall;
        inGroups        1(wall);
        nFaces          70;
        startFace       1990;
        sampleMode      nearestPatchFace;
        sampleRegion    water;
        samplePatch     water_to_solid;
    }
)

// ************************************************************************* //
